{
    "review_framework_version": "0.3",
    "device": {
        "vendor": "SK hynix",
        "product": "PE9x10",
        "category": "storage",
        "repo_tag": "",
        "fw_version": "51092A30",
        "fw_hash_sha2_384": "ce354ad441f89606764a90d67ce84c91a1b9ac429f3aac59ca1c807e8fbb29db0c47243e400ddae3ff0ca17b848d0154",
        "fw_hash_sha2_512": "44f23197ae2cb1bcf5e7f3b604d0bfde54c04368b7558d55c34aa9bee45b0a07388796f4beaf06b57e0e0f91ffaafdeb53fc20ce330374a3c4d21d74f39e4d5b"
    },
    "audit": {
        "srp": "IOActive, Incorporated",
        "methodology": "Whitebox Threat Model",
        "completion_date": "2023-07-14",
        "report_version": "1.0",
        "scope_number": "3.1",
        "cvss_version": "3.1",
        "issues": [
            {
                "title": "R1 - No Minimum Password Length",
                "cvss_score": "6.4",
                "cvss_vector": "AV:L/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:H",
                "cwe": "CWE-521: Weak Password Requirements",
                "description": "The drive currently does not enforce a minimum length or complexity requirements for passwords or PINs. Although the drive does enforce a maximum of five password attempts before requiring a power cycle; assuming 1 msecs per guess and 100 msecs for a power cycle a four-digit password or PIN could be brute forced on average in approximately 105 secs. An attacker with logical access to the drive may be able to brute-force weak passwords.",
                "cve": "none"
            },
            {
                "title": "R2 - NVMe and NVMe-MI Commands Return Metadata When Drive is Locked",
                "cvss_score": "2.3",
                "cvss_vector": "AV:L/AC:L/PR:H/UI:N/S:U/C:L/I:N/A:N",
                "cwe": "none",
                "description": "An attacker with logical access to the metadata may provide details that can be used to discover or exploit other vulnerabilities. The drive supports several NVMe commands via the PCIe interface that return metadata when the drive is locked including: Get Features - Returns details of which NVMe features are supported, Get Log Page - Returns various details about the current state of the drive including errors, Identify - Returns information about the NVM subsystem. The drive also supports NVMe-MI commands via the SMBus, which also return metadata when the drive is locked.",
                "cve": "none"
            }
        ]
    }
}
